richvies/CoolEase/old/stm32l051c8t6_rfm/CubeMX/Hub/Keil.STM32L0xx_DFP.2.1.0/CMSIS/Driver/USBD_STM32L0xx.c
/*! \page stm32l0_usbd CMSIS-Driver USBD Setup

The CMSIS-Driver USBD requires:
  - Setup of USB clock to 48MHz
  - Configuration of USB as Device (FS)

Valid settings for various evaluation boards are listed in the table below:

Peripheral Resource | STM32L073Z-EVAL |
:-------------------|:----------------|
USB Peripheral      | USB             |
D- Pin              | PA11            |
D+ Pin              | PA12            |

For different boards, refer to the hardware schematics to reflect correct setup values.

The STM32CubeMX configuration for STMicroelectronics STM32L073Z-EVAL Board with steps for Pinout, Clock, and System Configuration are 
listed below. Enter the values that are marked \b bold.

Pinout tab
----------
  1. Configure peripheral
     - Peripherals \b USB: enable <b>Device (FS)</b>

Clock Configuration tab
-----------------------
  1. Configure USB Clock: "USBCLK (MHz)": \b 48

Configuration tab
-----------------
  1. Under Connectivity open \b USB Configuration:
     - Parameter Settings: not used
     - User Constants: not used
     - <b>NVIC Settings</b>: enable interrupts
          Interrupt Table                           | Enabled | Preemption Priority
          :-----------------------------------------|:--------|:-------------------
          USB event interrupt / USB wake-up inter.. | \b ON   | 0

     - <b>GPIO Settings</b>: review settings, no changes required
          Pin Name | Signal on Pin | GPIO output..|  GPIO mode  | GPIO Pull-up/Pull..| Maximum out |  Fast Mode  | User Label
          :--------|:--------------|:-------------|:------------|:-------------------|:------------|:------------|:----------
          PA11     | USB_DM        | n/a          | n/a         | n/a                | n/a         | n/a         |.
          PA12     | USB_DP        | n/a          | n/a         | n/a                | n/a         | n/a         |.

     Click \b OK to close the USB Configuration dialog
*/

/*! \cond */

#include <string.h>

#include "stm32l0xx_hal_pcd.h"
#include "stm32l0xx.h"

#include "USBD_STM32L0xx.h"


#ifndef USBD_MAX_ENDPOINT_NUM
#define USBD_MAX_ENDPOINT_NUM          (2U)
#endif
#if    (USBD_MAX_ENDPOINT_NUM > 7U)
#error  Too many Endpoints, maximum IN/OUT Endpoint pairs that this driver supports is 7 !!!
#endif

// FIFO sizes in bytes (total available memory for FIFOs is 1.25 kB)
#ifndef USBD_EP0_RX_BUF_KIND
#define USBD_EP0_RX_BUF_KIND           (0U)
#endif
#ifndef USBD_EP0_RX_RAM_SIZE
#define USBD_EP0_RX_RAM_SIZE           (64U)
#endif
#ifndef USBD_EP0_TX_BUF_KIND
#define USBD_EP0_TX_BUF_KIND           (0U)
#endif
#ifndef USBD_EP0_TX_RAM_SIZE
#define USBD_EP0_TX_RAM_SIZE           (64U)
#endif

#ifndef USBD_EP1_RX_BUF_KIND
#define USBD_EP1_RX_BUF_KIND           (0U)
#endif
#ifndef USBD_EP1_RX_RAM_SIZE
#define USBD_EP1_RX_RAM_SIZE           (64U)
#endif
#ifndef USBD_EP1_TX_BUF_KIND
#define USBD_EP1_TX_BUF_KIND           (0U)
#endif
#ifndef USBD_EP1_TX_RAM_SIZE
#define USBD_EP1_TX_RAM_SIZE           (64U)
#endif

#ifndef USBD_EP2_RX_BUF_KIND
#define USBD_EP2_RX_BUF_KIND           (0U)
#endif
#ifndef USBD_EP2_RX_RAM_SIZE
#define USBD_EP2_RX_RAM_SIZE           (64U)
#endif
#ifndef USBD_EP2_TX_BUF_KIND
#define USBD_EP2_TX_BUF_KIND           (0U)
#endif
#ifndef USBD_EP2_TX_RAM_SIZE
#define USBD_EP2_TX_RAM_SIZE           (64U)
#endif

#ifndef USBD_EP3_RX_BUF_KIND
#define USBD_EP3_RX_BUF_KIND           (0U)
#endif
#ifndef USBD_EP3_RX_RAM_SIZE
#define USBD_EP3_RX_RAM_SIZE           (0U)
#endif
#ifndef USBD_EP3_TX_BUF_KIND
#define USBD_EP3_TX_BUF_KIND           (0U)
#endif
#ifndef USBD_EP3_TX_RAM_SIZE
#define USBD_EP3_TX_RAM_SIZE           (0U)
#endif

#ifndef USBD_EP4_RX_BUF_KIND
#define USBD_EP4_RX_BUF_KIND           (0U)
#endif
#ifndef USBD_EP4_RX_RAM_SIZE
#define USBD_EP4_RX_RAM_SIZE           (0U)
#endif
#ifndef USBD_EP4_TX_BUF_KIND
#define USBD_EP4_TX_BUF_KIND           (0U)
#endif
#ifndef USBD_EP4_TX_RAM_SIZE
#define USBD_EP4_TX_RAM_SIZE           (0U)
#endif

#ifndef USBD_EP5_RX_BUF_KIND
#define USBD_EP5_RX_BUF_KIND           (0U)
#endif
#ifndef USBD_EP5_RX_RAM_SIZE
#define USBD_EP5_RX_RAM_SIZE           (0U)
#endif
#ifndef USBD_EP5_TX_BUF_KIND
#define USBD_EP5_TX_BUF_KIND           (0U)
#endif
#ifndef USBD_EP5_TX_RAM_SIZE
#define USBD_EP5_TX_RAM_SIZE           (0U)
#endif

#ifndef USBD_EP6_RX_BUF_KIND
#define USBD_EP6_RX_BUF_KIND           (0U)
#endif
#ifndef USBD_EP6_RX_RAM_SIZE
#define USBD_EP6_RX_RAM_SIZE           (0U)
#endif
#ifndef USBD_EP6_TX_BUF_KIND
#define USBD_EP6_TX_BUF_KIND           (0U)
#endif
#ifndef USBD_EP6_TX_RAM_SIZE
#define USBD_EP6_TX_RAM_SIZE           (0U)
#endif

#ifndef USBD_EP7_RX_BUF_KIND
#define USBD_EP7_RX_BUF_KIND           (0U)
#endif
#ifndef USBD_EP7_RX_RAM_SIZE
#define USBD_EP7_RX_RAM_SIZE           (0U)
#endif
#ifndef USBD_EP7_TX_BUF_KIND
#define USBD_EP7_TX_BUF_KIND           (0U)
#endif
#ifndef USBD_EP7_TX_RAM_SIZE
#define USBD_EP7_TX_RAM_SIZE           (0U)
#endif

extern PCD_HandleTypeDef hpcd_USB_FS;


// USBD Driver *****************************************************************

#define ARM_USBD_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(1,3)

// Driver Version
static const ARM_DRIVER_VERSION usbd_driver_version = { ARM_USBD_API_VERSION, ARM_USBD_DRV_VERSION };

// Driver Capabilities
static const ARM_USBD_CAPABILITIES usbd_driver_capabilities = {
  0U,   // VBUS Detection
  0U,   // Event VBUS On
  0U    // Event VBUS Off
#if (defined(ARM_USBD_API_VERSION) && (ARM_USBD_API_VERSION >= 0x202U))
, 0U    // Reserved
#endif
};

#define EP_NUM(ep_addr)         ((ep_addr) & ARM_USB_ENDPOINT_NUMBER_MASK)
#define EP_ID(ep_addr)          ((EP_NUM(ep_addr) * 2U) + (((ep_addr) >> 7) & 1U))

typedef struct {
           uint16_t  rx_buf_kind;
           uint16_t  rx_ram_size;
           uint16_t  tx_buf_kind;
           uint16_t  tx_ram_size;
} USBD_EP_CONFIG_t;

typedef struct {                        // Endpoint structure definition
           uint8_t  *data;
           uint32_t  num;
  volatile uint32_t  num_transferred_total;
  volatile uint32_t  num_transferring;
           uint16_t  max_packet_size;
  volatile uint16_t  active;
  volatile uint8_t   xfer_flag;
  volatile uint8_t   int_flag;
           uint16_t  reserved;
} ENDPOINT_t;


